app/controllers/maps_controller.rb

SELECT * FROM "maps" ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @maps = Map.find(:all)
    @maps_paginate = Map.paginate :per_page => 10, :page => params[:page], :order => "created_at DESC"

SELECT * FROM "maps" WHERE ("maps"."id" = 1)
---
  def show
    @map = Map.find(params[:id])

INSERT INTO "maps" ("latitude", "updated_at", "category", "ref_id", "longitude", "user_id", "comment", "created_at") VALUES(42.733900454317414, '2009-04-29 17:57:47', 'highlight', NULL, -84.53533172607422, 1, 'test comment', '2009-04-29 17:57:47')
---
  def create
    @map = Map.new(params[:map])

    respond_to do |format|
      if @map.save