app/controllers/plog_controller.rb

  def index
    if params[:type] && params[:type] != ''
      @totem_events = TotemEvent.paginate :per_page => 10,
                                          :page => params[:page],
                                          :conditions => ["action_type LIKE ?", params[:type]],
                                          :order => 'created_at DESC'
---
SELECT * FROM "totem_events" WHERE (action_type LIKE 'comment') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "totem_events" WHERE (action_type LIKE 'feedarticle')