app/controllers/stories_controller.rb

SELECT * FROM "stories" ORDER BY location ASC, id DESC
---
  def index
    # using paginator instead of just a find
    # @stories = Story.find(:all, :order => 'location ASC, id DESC')
    @stories = Story.paginate :per_page => 10,
                              :page => params[:page],
                              :order => "created_at DESC"

SELECT * FROM "stories" WHERE ("stories"."id" = 2)
SELECT * FROM "maps" WHERE ("maps"."ref_id" = 1 AND "maps"."category" = 'story') LIMIT 1
---
  def show
    @story = Story.find(params[:id])

    @mapz0r = Map.find_by_ref_id_and_category(@story.id, 'story')

INSERT INTO "stories" ("image_url", "updated_at", "title", "body", "suspension_status", "url", "username", "suspended_at", "user_id", "created_at", "location") VALUES('', '2009-04-29 17:46:30', 'Test Story', 'This is a test story', NULL, '', NULL, NULL, 1, '2009-04-29 17:46:30', 'Eastside')
---
  def create
    @story = Story.new(params[:story])
    # Add the User ID to the hash
    @story.user = current_user

    respond_to do |format|
      if @story.save