app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "profile", "suspension_notes", "current_login_ip", "password_salt", "current_login_at", "role", "suspended_at", "persistence_token", "login_count", "display_name", "login", "last_login_ip", "email", "created_at") VALUES(NULL, NULL, '2009-04-29 16:34:20', '77fa3a127c3801d018d3197277c8393b8268639d9cdeddaecca010a901b78b448d9c553fe8c2e8c4bd2f939fe405285e4b2b22bec3d3806200428594d92ce0a9', '', NULL, NULL, '347c5c9f7ae7ed5fa44cb9cae71b95080e7c173c15f9b363b69b9fded9ff7d93aba462bf8323c1faeddc7e6c9f30b83cba72c2ad8db3ea99ff20c88595a6bd55', NULL, NULL, NULL, 'fea057a4489b26f5df8dbf4e728259a4688ffddfdb59e145185fb9e859482a8be5bedde6f465007205fc6e04228c00ea1c9dad3ffdba410ad1541e6161861604', NULL, 'John Monberg', 'jmonberg', NULL, 'jmonberg@msu.edu', '2009-04-29 16:34:20')

  def show
    # Let's look at the current user's profile.
    # NOTE: This is OK if we only let people look at their own profile, but
    # this doesn't work if we want to allow people to look at anybody's profile.
    #@user = @current_user

    # Let's look at the user profile specified by the ID parameter
    @user     = User.find(params[:id] || current_user)
    @articles = Article.paginate :per_page => 3,
                                 :page => params[:page],
                                 :conditions => 'user_id = ' + @user.id.to_s,
                                 :order => "updated_at DESC"
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "articles" WHERE (user_id = 1) ORDER BY updated_at DESC LIMIT 3 OFFSET 0

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "last_request_at" = '2009-04-29 18:07:50', "updated_at" = '2009-04-29 18:07:50' WHERE "id" = 1