app/controllers/votes_controller.rb

  def create
    @article = Article.find(params[:article_id])
    # debugger
    if (params[:commit] == "Yes")
      @article.votes.create(:positive => true)
    else
      @article.votes.create(:positive => false)
    end
    @positivevotes = @article.votes.find_all_by_positive(true) || []
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)
INSERT INTO "votes" ("updated_at", "positive", "article_id", "created_at") VALUES('2009-04-29 17:43:03', 'f', 1, '2009-04-29 17:43:03')
SELECT * FROM "votes" WHERE ("votes"."positive" = 't') AND ("votes".article_id = 1)